#+TITLE: Text mining in practice - Bag of Words - Intro to word networks
#+AUTHOR: Marcus Birkenkrahe
#+SUBTITLE: Digital Humanities DSC 105 Spring 2023
#+STARTUP:overview hideblocks indent inlineimages
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:R :session *R* :results output :exports both :noweb yes
* Get the corpus data and the R packages

- Load the ~.RData~ file [[https://bit.ly/tm_rdata][from GitHub]] (*bit.ly/tm_rdata*) in your current R
  session and check that packages and user-defined objects were
  loaded (load from the right location):
  #+begin_src R
    <<load_packages>>
    load("c:/Users/birkenkrahe/Downloads/.RData")
  #+end_src

- You need the ~clean_coffee~ and ~clean_chardonnay~ corpora:
  #+begin_src R
    ls()
  #+end_src

  #+RESULTS:
  #+begin_example
   [1] "api_key"                 "ask_chatgpt"            
   [3] "bar"                     "chardonnay_corpus"      
   [5] "chardonnay_df"           "chardonnay_src"         
   [7] "chardonnay_vec"          "clean_chardonnay"       
   [9] "clean_chardonnay_corpus" "clean_coffee"           
  [11] "clean_coffee_corpus"     "coffee_corpus"          
  [13] "coffee_df"               "coffee_src"             
  [15] "coffee_vec"              "convert_counts"         
  [17] "foo"                     "ham"                    
  [19] "load_packages"           "m"                      
  [21] "sms_classifier"          "sms_classifier_"        
  [23] "sms_classifier2"         "sms_corpus"             
  [25] "sms_corpus_clean"        "sms_dtm"                
  [27] "sms_dtm_freq_test"       "sms_dtm_freq_train"     
  [29] "sms_dtm_test"            "sms_dtm_train"          
  [31] "sms_dtm2"                "sms_freq_words"         
  [33] "sms_raw"                 "sms_test"               
  [35] "sms_test_labels"         "sms_test_pred"          
  [37] "sms_test_pred2"          "sms_train"              
  [39] "sms_train_labels"        "spam"                   
  [41] "string"                  "stringX"                
  [43] "text_df"                 "tokens"
  #+end_example

* Visualize dissimilar words with ~comparison.cloud~

- To visualize dissimilar words, you can use ~comparison.cloud~, which
  has quite a few more arguments:
  #+begin_src R

  #+end_src

- Clean the corpus, create TDM:
  #+begin_src R
    <<all_clean>>
    <<all_tdm>>
  #+end_src

- The ~tdm~ is organized neatly in two columns:
  #+begin_src R
    as.matrix()
  #+end_src

- Use ~colnames~ to rename each distinct corpora within ~all_tdm~ so that
  we can keep track of the contributions from either corpus:
  #+name: colnames
  #+begin_src R
    colnames(all_tdm) <-
    as.matrix()
  #+end_src

  #+RESULTS:
  :            Docs
  : Terms       coffee chardonnay
  :   asia           1          0
  :   asian          1          1
  :   ask            6          4
  :   asked          3          1
  :   asking         0          6
  :   askorange      2          0

- Create a matrix ~all_m~ from ~all_tdm~:
  #+begin_src R
    all_m <- 
  #+end_src

- Create a comparison cloud with ~max.words=50~ and the ~colors~ "orange"
  and "blue":
  #+begin_src R :results graphics file :file comparisoncloud.png
    <<all_clean>>
    <<all_tdm>>
    <<colnames>>
    comparison.cloud()
  #+end_src

